# Homebrew
update
upgrade

# CLI tools
brew "docker-machine"
brew "jupyterlab"
brew "btop"
brew "ncdu"
brew "gemini-cli"
brew "webp"
brew "wget"
brew "curl"
brew "composer"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "git"
brew "node"
brew "nvm"
brew "php"
brew "ollama"
brew "mole"

# Cask applications
cask "notion"
cask "zoom"
cask "brave-browser"
cask "chatgpt"
cask "herd"
cask "raycast"
cask "monitorcontrol"
cask "cursor"
cask "visual-studio-code"
cask "iterm2"
cask "orbstack"
cask "postman"
cask "ollama-app"
